nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1225                                       0x00000384

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1226                                       0x00000388

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1227                                       0x0000038C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1228                                       0x00000390

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1229                                       0x00000394

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1230                                       0x00000398

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1231                                       0x0000039C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1232                                       0x000003A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1233                                       0x000003A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1234                                       0x000003A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1235                                       0x000003AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1236                                       0x000003B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1237                                       0x000003B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1238                                       0x000003B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1239                                       0x000003BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1240                                       0x000003C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1241                                       0x000003C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1242                                       0x000003C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1243                                       0x000003CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1244                                       0x000003D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1245                                       0x000003D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1246                                       0x000003D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1247                                       0x000003DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1248                                       0x000003E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1249                                       0x000003E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1250                                       0x000003E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1251                                       0x000003EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1252                                       0x000003F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1253                                       0x000003F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1254                                       0x000003F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1255                                       0x000003FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1256                                       0x00000400

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1257                                       0x00000404

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1258                                       0x00000408

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1259                                       0x0000040C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1260                                       0x00000410

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1261                                       0x00000414

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1262                                       0x00000418

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1263                                       0x0000041C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1264                                       0x00000420

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1265                                       0x00000424

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1266                                       0x00000428

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1267                                       0x0000042C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1268                                       0x00000430

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1269                                       0x00000434

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1270                                       0x00000438

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1271                                       0x0000043C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1272                                       0x00000440

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1273                                       0x00000444

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1274                                       0x00000448

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1275                                       0x0000044C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1276                                       0x00000450

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1277                                       0x00000454

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1278                                       0x00000458

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1279                                       0x0000045C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1280                                       0x00000460

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1281                                       0x00000464

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1282                                       0x00000468

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1283                                       0x0000046C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1284                                       0x00000470

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1285                                       0x00000474

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1286                                       0x00000478

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1287                                       0x0000047C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1288                                       0x00000480

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1289                                       0x00000484

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1290                                       0x00000488

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1291                                       0x0000048C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1292                                       0x00000490

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1293                                       0x00000494

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1294                                       0x00000498

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1295                                       0x0000049C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1296                                       0x000004A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1297                                       0x000004A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1298                                       0x000004A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1299                                       0x000004AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1300                                       0x000004B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1301                                       0x000004B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1302                                       0x000004B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1303                                       0x000004BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1304                                       0x000004C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1305                                       0x000004C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1306                                       0x000004C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1307                                       0x000004CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1308                                       0x000004D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1309                                       0x000004D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1310                                       0x000004D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1311                                       0x000004DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1312                                       0x000004E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1313                                       0x000004E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1314                                       0x000004E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1315                                       0x000004EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1316                                       0x000004F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1317                                       0x000004F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1318                                       0x000004F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1319                                       0x000004FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1320                                       0x00000500

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1321                                       0x00000504

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1322                                       0x00000508

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1323                                       0x0000050C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1324                                       0x00000510

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1325                                       0x00000514

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1326                                       0x00000518

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1327                                       0x0000051C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1328                                       0x00000520

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1329                                       0x00000524

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1330                                       0x00000528

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1331                                       0x0000052C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1332                                       0x00000530

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1333                                       0x00000534

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1334                                       0x00000538

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1335                                       0x0000053C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1336                                       0x00000540

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1337                                       0x00000544

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1338                                       0x00000548

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1339                                       0x0000054C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1340                                       0x00000550

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1341                                       0x00000554

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1342                                       0x00000558

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1343                                       0x0000055C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1344                                       0x00000560

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1345                                       0x00000564

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1346                                       0x00000568

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1347                                       0x0000056C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1348                                       0x00000570

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1349                                       0x00000574

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1350                                       0x00000578

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1351                                       0x0000057C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1352                                       0x00000580

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1353                                       0x00000584

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1354                                       0x00000588

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1355                                       0x0000058C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1356                                       0x00000590

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1357                                       0x00000594

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1358                                       0x00000598

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1359                                       0x0000059C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1360                                       0x000005A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1361                                       0x000005A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1362                                       0x000005A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1363                                       0x000005AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1364                                       0x000005B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1365                                       0x000005B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1366                                       0x000005B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1367                                       0x000005BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1368                                       0x000005C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1369                                       0x000005C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1370                                       0x000005C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1371                                       0x000005CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1372                                       0x000005D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1373                                       0x000005D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1374                                       0x000005D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1375                                       0x000005DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1376                                       0x000005E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1377                                       0x000005E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1378                                       0x000005E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1379                                       0x000005EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1380                                       0x000005F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1381                                       0x000005F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1382                                       0x000005F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1383                                       0x000005FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1384                                       0x00000600

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1385                                       0x00000604

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1386                                       0x00000608

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1387                                       0x0000060C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1388                                       0x00000610

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1389                                       0x00000614

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1390                                       0x00000618

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1391                                       0x0000061C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1392                                       0x00000620

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1393                                       0x00000624

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1394                                       0x00000628

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1395                                       0x0000062C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1396                                       0x00000630

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1397                                       0x00000634

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1398                                       0x00000638

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1399                                       0x0000063C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1400                                       0x00000640

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1401                                       0x00000644

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1402                                       0x00000648

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1403                                       0x0000064C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1404                                       0x00000650

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1405                                       0x00000654

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1406                                       0x00000658

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1407                                       0x0000065C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1408                                       0x00000660

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1409                                       0x00000664

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1410                                       0x00000668

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1411                                       0x0000066C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1412                                       0x00000670

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1413                                       0x00000674

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1414                                       0x00000678

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1415                                       0x0000067C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1416                                       0x00000680

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1417                                       0x00000684

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1418                                       0x00000688

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1419                                       0x0000068C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1420                                       0x00000690

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1421                                       0x00000694

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1422                                       0x00000698

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1423                                       0x0000069C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1424                                       0x000006A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1425                                       0x000006A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1426                                       0x000006A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1427                                       0x000006AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1428                                       0x000006B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1429                                       0x000006B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1430                                       0x000006B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1431                                       0x000006BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1432                                       0x000006C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1433                                       0x000006C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1434                                       0x000006C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1435                                       0x000006CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1436                                       0x000006D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1437                                       0x000006D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1438                                       0x000006D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1439                                       0x000006DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1440                                       0x000006E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1441                                       0x000006E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1442                                       0x000006E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1443                                       0x000006EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1444                                       0x000006F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1445                                       0x000006F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1446                                       0x000006F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1447                                       0x000006FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1448                                       0x00000700

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1449                                       0x00000704

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1450                                       0x00000708

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1451                                       0x0000070C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1452                                       0x00000710

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1453                                       0x00000714

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1454                                       0x00000718

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1455                                       0x0000071C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1456                                       0x00000720

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1457                                       0x00000724

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1458                                       0x00000728

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1459                                       0x0000072C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1460                                       0x00000730

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1461                                       0x00000734

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1462                                       0x00000738

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1463                                       0x0000073C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1464                                       0x00000740

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1465                                       0x00000744

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1466                                       0x00000748

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1467                                       0x0000074C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1468                                       0x00000750

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1469                                       0x00000754

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1470                                       0x00000758

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1471                                       0x0000075C

