nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11213                                      0x000012F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11214                                      0x000012F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11215                                      0x000012FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11216                                      0x00001300

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11217                                      0x00001304

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11218                                      0x00001308

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11219                                      0x0000130C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11220                                      0x00001310

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11221                                      0x00001314

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11222                                      0x00001318

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11223                                      0x0000131C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11224                                      0x00001320

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11225                                      0x00001324

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11226                                      0x00001328

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11227                                      0x0000132C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11228                                      0x00001330

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11229                                      0x00001334

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11230                                      0x00001338

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11231                                      0x0000133C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11232                                      0x00001340

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11233                                      0x00001344

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11234                                      0x00001348

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11235                                      0x0000134C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11236                                      0x00001350

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11237                                      0x00001354

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11238                                      0x00001358

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11239                                      0x0000135C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11240                                      0x00001360

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11241                                      0x00001364

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11242                                      0x00001368

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11243                                      0x0000136C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11244                                      0x00001370

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11245                                      0x00001374

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11246                                      0x00001378

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11247                                      0x0000137C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11248                                      0x00001380

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11249                                      0x00001384

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11250                                      0x00001388

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11251                                      0x0000138C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11252                                      0x00001390

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11253                                      0x00001394

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11254                                      0x00001398

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11255                                      0x0000139C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11256                                      0x000013A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11257                                      0x000013A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11258                                      0x000013A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11259                                      0x000013AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11260                                      0x000013B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11261                                      0x000013B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11262                                      0x000013B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11263                                      0x000013BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11264                                      0x000013C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11265                                      0x000013C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11266                                      0x000013C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11267                                      0x000013CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11268                                      0x000013D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11269                                      0x000013D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11270                                      0x000013D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11271                                      0x000013DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11272                                      0x000013E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11273                                      0x000013E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11274                                      0x000013E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11275                                      0x000013EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11276                                      0x000013F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11277                                      0x000013F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11278                                      0x000013F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11279                                      0x000013FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11280                                      0x00001400

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11281                                      0x00001404

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11282                                      0x00001408

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11283                                      0x0000140C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11284                                      0x00001410

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11285                                      0x00001414

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11286                                      0x00001418

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11287                                      0x0000141C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11288                                      0x00001420

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11289                                      0x00001424

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11290                                      0x00001428

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11291                                      0x0000142C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11292                                      0x00001430

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11293                                      0x00001434

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11294                                      0x00001438

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11295                                      0x0000143C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11296                                      0x00001440

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11297                                      0x00001444

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11298                                      0x00001448

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11299                                      0x0000144C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11300                                      0x00001450

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11301                                      0x00001454

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11302                                      0x00001458

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11303                                      0x0000145C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11304                                      0x00001460

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11305                                      0x00001464

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11306                                      0x00001468

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11307                                      0x0000146C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11308                                      0x00001470

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11309                                      0x00001474

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11310                                      0x00001478

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11311                                      0x0000147C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11312                                      0x00001480

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11313                                      0x00001484

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11314                                      0x00001488

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11315                                      0x0000148C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11316                                      0x00001490

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11317                                      0x00001494

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11318                                      0x00001498

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11319                                      0x0000149C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11320                                      0x000014A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11321                                      0x000014A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11322                                      0x000014A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11323                                      0x000014AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11324                                      0x000014B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11325                                      0x000014B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11326                                      0x000014B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11327                                      0x000014BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11328                                      0x000014C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11329                                      0x000014C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11330                                      0x000014C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11331                                      0x000014CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11332                                      0x000014D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11333                                      0x000014D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11334                                      0x000014D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11335                                      0x000014DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11336                                      0x000014E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11337                                      0x000014E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11338                                      0x000014E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11339                                      0x000014EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11340                                      0x000014F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11341                                      0x000014F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11342                                      0x000014F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11343                                      0x000014FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11344                                      0x00001500

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11345                                      0x00001504

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11346                                      0x00001508

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11347                                      0x0000150C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11348                                      0x00001510

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11349                                      0x00001514

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11350                                      0x00001518

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11351                                      0x0000151C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11352                                      0x00001520

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11353                                      0x00001524

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11354                                      0x00001528

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11355                                      0x0000152C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11356                                      0x00001530

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11357                                      0x00001534

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11358                                      0x00001538

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11359                                      0x0000153C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11360                                      0x00001540

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11361                                      0x00001544

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11362                                      0x00001548

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11363                                      0x0000154C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11364                                      0x00001550

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11365                                      0x00001554

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11366                                      0x00001558

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11367                                      0x0000155C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11368                                      0x00001560

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11369                                      0x00001564

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11370                                      0x00001568

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11371                                      0x0000156C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11372                                      0x00001570

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11373                                      0x00001574

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11374                                      0x00001578

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11375                                      0x0000157C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11376                                      0x00001580

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11377                                      0x00001584

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11378                                      0x00001588

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11379                                      0x0000158C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11380                                      0x00001590

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11381                                      0x00001594

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11382                                      0x00001598

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11383                                      0x0000159C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11384                                      0x000015A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11385                                      0x000015A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11386                                      0x000015A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11387                                      0x000015AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11388                                      0x000015B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11389                                      0x000015B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11390                                      0x000015B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11391                                      0x000015BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11392                                      0x000015C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11393                                      0x000015C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11394                                      0x000015C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11395                                      0x000015CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11396                                      0x000015D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11397                                      0x000015D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11398                                      0x000015D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11399                                      0x000015DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11400                                      0x000015E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11401                                      0x000015E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11402                                      0x000015E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11403                                      0x000015EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11404                                      0x000015F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11405                                      0x000015F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11406                                      0x000015F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11407                                      0x000015FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11408                                      0x00001600

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11409                                      0x00001604

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11410                                      0x00001608

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11411                                      0x0000160C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11412                                      0x00001610

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11413                                      0x00001614

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11414                                      0x00001618

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11415                                      0x0000161C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11416                                      0x00001620

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11417                                      0x00001624

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11418                                      0x00001628

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11419                                      0x0000162C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11420                                      0x00001630

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11421                                      0x00001634

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11422                                      0x00001638

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11423                                      0x0000163C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11424                                      0x00001640

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11425                                      0x00001644

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11426                                      0x00001648

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11427                                      0x0000164C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11428                                      0x00001650

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11429                                      0x00001654

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11430                                      0x00001658

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11431                                      0x0000165C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11432                                      0x00001660

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11433                                      0x00001664

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11434                                      0x00001668

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11435                                      0x0000166C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11436                                      0x00001670

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11437                                      0x00001674

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11438                                      0x00001678

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11439                                      0x0000167C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11440                                      0x00001680

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11441                                      0x00001684

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11442                                      0x00001688

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11443                                      0x0000168C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11444                                      0x00001690

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11445                                      0x00001694

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11446                                      0x00001698

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11447                                      0x0000169C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11448                                      0x000016A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11449                                      0x000016A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11450                                      0x000016A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11451                                      0x000016AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11452                                      0x000016B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11453                                      0x000016B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11454                                      0x000016B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11455                                      0x000016BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11456                                      0x000016C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11457                                      0x000016C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11458                                      0x000016C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11459                                      0x000016CC

