nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11460                                      0x000016D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11461                                      0x000016D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11462                                      0x000016D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11463                                      0x000016DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11464                                      0x000016E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11465                                      0x000016E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11466                                      0x000016E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11467                                      0x000016EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11468                                      0x000016F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11469                                      0x000016F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11470                                      0x000016F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11471                                      0x000016FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11472                                      0x00001700

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11473                                      0x00001704

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11474                                      0x00001708

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11475                                      0x0000170C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11476                                      0x00001710

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11477                                      0x00001714

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11478                                      0x00001718

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11479                                      0x0000171C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11480                                      0x00001720

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11481                                      0x00001724

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11482                                      0x00001728

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11483                                      0x0000172C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11484                                      0x00001730

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11485                                      0x00001734

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11486                                      0x00001738

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11487                                      0x0000173C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11488                                      0x00001740

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11489                                      0x00001744

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11490                                      0x00001748

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11491                                      0x0000174C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11492                                      0x00001750

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11493                                      0x00001754

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11494                                      0x00001758

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11495                                      0x0000175C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11496                                      0x00001760

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11497                                      0x00001764

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11498                                      0x00001768

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11499                                      0x0000176C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11500                                      0x00001770

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11501                                      0x00001774

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11502                                      0x00001778

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11503                                      0x0000177C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11504                                      0x00001780

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11505                                      0x00001784

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11506                                      0x00001788

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11507                                      0x0000178C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11508                                      0x00001790

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11509                                      0x00001794

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11510                                      0x00001798

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11511                                      0x0000179C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11512                                      0x000017A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11513                                      0x000017A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11514                                      0x000017A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11515                                      0x000017AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11516                                      0x000017B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11517                                      0x000017B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11518                                      0x000017B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11519                                      0x000017BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11520                                      0x000017C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11521                                      0x000017C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11522                                      0x000017C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11523                                      0x000017CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11524                                      0x000017D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11525                                      0x000017D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11526                                      0x000017D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11527                                      0x000017DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11528                                      0x000017E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11529                                      0x000017E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11530                                      0x000017E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11531                                      0x000017EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11532                                      0x000017F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11533                                      0x000017F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11534                                      0x000017F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11535                                      0x000017FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11536                                      0x00001800

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11537                                      0x00001804

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11538                                      0x00001808

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11539                                      0x0000180C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11540                                      0x00001810

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11541                                      0x00001814

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11542                                      0x00001818

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11543                                      0x0000181C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11544                                      0x00001820

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11545                                      0x00001824

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11546                                      0x00001828

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11547                                      0x0000182C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11548                                      0x00001830

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11549                                      0x00001834

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11550                                      0x00001838

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11551                                      0x0000183C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11552                                      0x00001840

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11553                                      0x00001844

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11554                                      0x00001848

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11555                                      0x0000184C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11556                                      0x00001850

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11557                                      0x00001854

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11558                                      0x00001858

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11559                                      0x0000185C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11560                                      0x00001860

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11561                                      0x00001864

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11562                                      0x00001868

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11563                                      0x0000186C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11564                                      0x00001870

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11565                                      0x00001874

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11566                                      0x00001878

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11567                                      0x0000187C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11568                                      0x00001880

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11569                                      0x00001884

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11570                                      0x00001888

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11571                                      0x0000188C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11572                                      0x00001890

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11573                                      0x00001894

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11574                                      0x00001898

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11575                                      0x0000189C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11576                                      0x000018A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11577                                      0x000018A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11578                                      0x000018A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11579                                      0x000018AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11580                                      0x000018B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11581                                      0x000018B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11582                                      0x000018B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11583                                      0x000018BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11584                                      0x000018C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11585                                      0x000018C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11586                                      0x000018C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11587                                      0x000018CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11588                                      0x000018D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11589                                      0x000018D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11590                                      0x000018D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11591                                      0x000018DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11592                                      0x000018E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11593                                      0x000018E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11594                                      0x000018E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11595                                      0x000018EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11596                                      0x000018F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11597                                      0x000018F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11598                                      0x000018F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11599                                      0x000018FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11600                                      0x00001900

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11601                                      0x00001904

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11602                                      0x00001908

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11603                                      0x0000190C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11604                                      0x00001910

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11605                                      0x00001914

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11606                                      0x00001918

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11607                                      0x0000191C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11608                                      0x00001920

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11609                                      0x00001924

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11610                                      0x00001928

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11611                                      0x0000192C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11612                                      0x00001930

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11613                                      0x00001934

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11614                                      0x00001938

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11615                                      0x0000193C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11616                                      0x00001940

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11617                                      0x00001944

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11618                                      0x00001948

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11619                                      0x0000194C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11620                                      0x00001950

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11621                                      0x00001954

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11622                                      0x00001958

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11623                                      0x0000195C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11624                                      0x00001960

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11625                                      0x00001964

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11626                                      0x00001968

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11627                                      0x0000196C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11628                                      0x00001970

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11629                                      0x00001974

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11630                                      0x00001978

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11631                                      0x0000197C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11632                                      0x00001980

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11633                                      0x00001984

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11634                                      0x00001988

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11635                                      0x0000198C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11636                                      0x00001990

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11637                                      0x00001994

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11638                                      0x00001998

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11639                                      0x0000199C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11640                                      0x000019A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11641                                      0x000019A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11642                                      0x000019A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11643                                      0x000019AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11644                                      0x000019B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11645                                      0x000019B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11646                                      0x000019B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11647                                      0x000019BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11648                                      0x000019C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11649                                      0x000019C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11650                                      0x000019C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11651                                      0x000019CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11652                                      0x000019D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11653                                      0x000019D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11654                                      0x000019D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11655                                      0x000019DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11656                                      0x000019E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11657                                      0x000019E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11658                                      0x000019E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11659                                      0x000019EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11660                                      0x000019F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11661                                      0x000019F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11662                                      0x000019F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11663                                      0x000019FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11664                                      0x00001A00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11665                                      0x00001A04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11666                                      0x00001A08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11667                                      0x00001A0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11668                                      0x00001A10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11669                                      0x00001A14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11670                                      0x00001A18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11671                                      0x00001A1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11672                                      0x00001A20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11673                                      0x00001A24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11674                                      0x00001A28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11675                                      0x00001A2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11676                                      0x00001A30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11677                                      0x00001A34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11678                                      0x00001A38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11679                                      0x00001A3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11680                                      0x00001A40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11681                                      0x00001A44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11682                                      0x00001A48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11683                                      0x00001A4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11684                                      0x00001A50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11685                                      0x00001A54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11686                                      0x00001A58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11687                                      0x00001A5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11688                                      0x00001A60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11689                                      0x00001A64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11690                                      0x00001A68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11691                                      0x00001A6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11692                                      0x00001A70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11693                                      0x00001A74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11694                                      0x00001A78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11695                                      0x00001A7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11696                                      0x00001A80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11697                                      0x00001A84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11698                                      0x00001A88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11699                                      0x00001A8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11700                                      0x00001A90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11701                                      0x00001A94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11702                                      0x00001A98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11703                                      0x00001A9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11704                                      0x00001AA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11705                                      0x00001AA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11706                                      0x00001AA8

