nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK181
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK181_DATA_W                                           32
#define RFC_ULLRAM_BANK181_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK181_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK182
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK182_DATA_W                                           32
#define RFC_ULLRAM_BANK182_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK182_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK183
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK183_DATA_W                                           32
#define RFC_ULLRAM_BANK183_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK183_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK184
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK184_DATA_W                                           32
#define RFC_ULLRAM_BANK184_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK184_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK185
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK185_DATA_W                                           32
#define RFC_ULLRAM_BANK185_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK185_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK186
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK186_DATA_W                                           32
#define RFC_ULLRAM_BANK186_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK186_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK187
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK187_DATA_W                                           32
#define RFC_ULLRAM_BANK187_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK187_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK188
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK188_DATA_W                                           32
#define RFC_ULLRAM_BANK188_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK188_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK189
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK189_DATA_W                                           32
#define RFC_ULLRAM_BANK189_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK189_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK190
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK190_DATA_W                                           32
#define RFC_ULLRAM_BANK190_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK190_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK191
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK191_DATA_W                                           32
#define RFC_ULLRAM_BANK191_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK191_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK192
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK192_DATA_W                                           32
#define RFC_ULLRAM_BANK192_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK192_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK193
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK193_DATA_W                                           32
#define RFC_ULLRAM_BANK193_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK193_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK194
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK194_DATA_W                                           32
#define RFC_ULLRAM_BANK194_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK194_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK195
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK195_DATA_W                                           32
#define RFC_ULLRAM_BANK195_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK195_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK196
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK196_DATA_W                                           32
#define RFC_ULLRAM_BANK196_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK196_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK197
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK197_DATA_W                                           32
#define RFC_ULLRAM_BANK197_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK197_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK198_DATA_W                                           32
#define RFC_ULLRAM_BANK198_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK198_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK199_DATA_W                                           32
#define RFC_ULLRAM_BANK199_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK199_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1100
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1100_DATA_W                                          32
#define RFC_ULLRAM_BANK1100_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1100_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1101
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1101_DATA_W                                          32
#define RFC_ULLRAM_BANK1101_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1101_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1102
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1102_DATA_W                                          32
#define RFC_ULLRAM_BANK1102_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1102_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1103
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1103_DATA_W                                          32
#define RFC_ULLRAM_BANK1103_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1103_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1104
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1104_DATA_W                                          32
#define RFC_ULLRAM_BANK1104_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1104_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1105
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1105_DATA_W                                          32
#define RFC_ULLRAM_BANK1105_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1105_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1106
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1106_DATA_W                                          32
#define RFC_ULLRAM_BANK1106_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1106_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1107
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1107_DATA_W                                          32
#define RFC_ULLRAM_BANK1107_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1107_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1108
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1108_DATA_W                                          32
#define RFC_ULLRAM_BANK1108_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1108_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1109
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1109_DATA_W                                          32
#define RFC_ULLRAM_BANK1109_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1109_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1110
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1110_DATA_W                                          32
#define RFC_ULLRAM_BANK1110_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1110_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1111
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1111_DATA_W                                          32
#define RFC_ULLRAM_BANK1111_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1111_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1112
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1112_DATA_W                                          32
#define RFC_ULLRAM_BANK1112_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1112_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1113
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1113_DATA_W                                          32
#define RFC_ULLRAM_BANK1113_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1113_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1114
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1114_DATA_W                                          32
#define RFC_ULLRAM_BANK1114_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1114_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1115
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1115_DATA_W                                          32
#define RFC_ULLRAM_BANK1115_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1115_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1116
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1116_DATA_W                                          32
#define RFC_ULLRAM_BANK1116_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1116_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1117
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1117_DATA_W                                          32
#define RFC_ULLRAM_BANK1117_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1117_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1118
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1118_DATA_W                                          32
#define RFC_ULLRAM_BANK1118_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1118_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1119
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1119_DATA_W                                          32
#define RFC_ULLRAM_BANK1119_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1119_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1120
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1120_DATA_W                                          32
#define RFC_ULLRAM_BANK1120_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1120_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1121
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1121_DATA_W                                          32
#define RFC_ULLRAM_BANK1121_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1121_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1122
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1122_DATA_W                                          32
#define RFC_ULLRAM_BANK1122_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1122_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1123
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1123_DATA_W                                          32
#define RFC_ULLRAM_BANK1123_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1123_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1124
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1124_DATA_W                                          32
#define RFC_ULLRAM_BANK1124_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1124_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1125
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1125_DATA_W                                          32
#define RFC_ULLRAM_BANK1125_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1125_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1126
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1126_DATA_W                                          32
#define RFC_ULLRAM_BANK1126_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1126_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1127
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1127_DATA_W                                          32
#define RFC_ULLRAM_BANK1127_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1127_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1128
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1128_DATA_W                                          32
#define RFC_ULLRAM_BANK1128_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1128_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1129
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1129_DATA_W                                          32
#define RFC_ULLRAM_BANK1129_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1129_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1130
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1130_DATA_W                                          32
#define RFC_ULLRAM_BANK1130_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1130_DATA_S                                           0

