nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1181
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1181_DATA_W                                          32
#define RFC_ULLRAM_BANK1181_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1181_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1182
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1182_DATA_W                                          32
#define RFC_ULLRAM_BANK1182_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1182_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1183
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1183_DATA_W                                          32
#define RFC_ULLRAM_BANK1183_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1183_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1184
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1184_DATA_W                                          32
#define RFC_ULLRAM_BANK1184_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1184_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1185
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1185_DATA_W                                          32
#define RFC_ULLRAM_BANK1185_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1185_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1186
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1186_DATA_W                                          32
#define RFC_ULLRAM_BANK1186_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1186_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1187
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1187_DATA_W                                          32
#define RFC_ULLRAM_BANK1187_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1187_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1188
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1188_DATA_W                                          32
#define RFC_ULLRAM_BANK1188_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1188_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1189
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1189_DATA_W                                          32
#define RFC_ULLRAM_BANK1189_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1189_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1190
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1190_DATA_W                                          32
#define RFC_ULLRAM_BANK1190_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1190_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1191
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1191_DATA_W                                          32
#define RFC_ULLRAM_BANK1191_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1191_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1192
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1192_DATA_W                                          32
#define RFC_ULLRAM_BANK1192_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1192_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1193
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1193_DATA_W                                          32
#define RFC_ULLRAM_BANK1193_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1193_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1194
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1194_DATA_W                                          32
#define RFC_ULLRAM_BANK1194_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1194_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1195
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1195_DATA_W                                          32
#define RFC_ULLRAM_BANK1195_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1195_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1196
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1196_DATA_W                                          32
#define RFC_ULLRAM_BANK1196_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1196_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1197
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1197_DATA_W                                          32
#define RFC_ULLRAM_BANK1197_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1197_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1198_DATA_W                                          32
#define RFC_ULLRAM_BANK1198_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1198_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1199_DATA_W                                          32
#define RFC_ULLRAM_BANK1199_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1199_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1200
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1200_DATA_W                                          32
#define RFC_ULLRAM_BANK1200_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1200_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1201
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1201_DATA_W                                          32
#define RFC_ULLRAM_BANK1201_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1201_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1202
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1202_DATA_W                                          32
#define RFC_ULLRAM_BANK1202_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1202_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1203
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1203_DATA_W                                          32
#define RFC_ULLRAM_BANK1203_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1203_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1204
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1204_DATA_W                                          32
#define RFC_ULLRAM_BANK1204_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1204_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1205
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1205_DATA_W                                          32
#define RFC_ULLRAM_BANK1205_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1205_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1206
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1206_DATA_W                                          32
#define RFC_ULLRAM_BANK1206_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1206_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1207
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1207_DATA_W                                          32
#define RFC_ULLRAM_BANK1207_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1207_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1208
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1208_DATA_W                                          32
#define RFC_ULLRAM_BANK1208_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1208_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1209
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1209_DATA_W                                          32
#define RFC_ULLRAM_BANK1209_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1209_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1210
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1210_DATA_W                                          32
#define RFC_ULLRAM_BANK1210_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1210_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1211
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1211_DATA_W                                          32
#define RFC_ULLRAM_BANK1211_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1211_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1212
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1212_DATA_W                                          32
#define RFC_ULLRAM_BANK1212_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1212_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1213
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1213_DATA_W                                          32
#define RFC_ULLRAM_BANK1213_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1213_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1214
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1214_DATA_W                                          32
#define RFC_ULLRAM_BANK1214_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1214_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1215
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1215_DATA_W                                          32
#define RFC_ULLRAM_BANK1215_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1215_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1216
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1216_DATA_W                                          32
#define RFC_ULLRAM_BANK1216_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1216_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1217
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1217_DATA_W                                          32
#define RFC_ULLRAM_BANK1217_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1217_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1218
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1218_DATA_W                                          32
#define RFC_ULLRAM_BANK1218_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1218_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1219
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1219_DATA_W                                          32
#define RFC_ULLRAM_BANK1219_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1219_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1220
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1220_DATA_W                                          32
#define RFC_ULLRAM_BANK1220_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1220_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1221
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1221_DATA_W                                          32
#define RFC_ULLRAM_BANK1221_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1221_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1222
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1222_DATA_W                                          32
#define RFC_ULLRAM_BANK1222_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1222_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1223
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1223_DATA_W                                          32
#define RFC_ULLRAM_BANK1223_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1223_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1224
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1224_DATA_W                                          32
#define RFC_ULLRAM_BANK1224_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1224_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1225
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1225_DATA_W                                          32
#define RFC_ULLRAM_BANK1225_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1225_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1226
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1226_DATA_W                                          32
#define RFC_ULLRAM_BANK1226_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1226_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1227
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1227_DATA_W                                          32
#define RFC_ULLRAM_BANK1227_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1227_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1228
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1228_DATA_W                                          32
#define RFC_ULLRAM_BANK1228_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1228_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1229
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1229_DATA_W                                          32
#define RFC_ULLRAM_BANK1229_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1229_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1230
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1230_DATA_W                                          32
#define RFC_ULLRAM_BANK1230_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1230_DATA_S                                           0

