nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1231
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1231_DATA_W                                          32
#define RFC_ULLRAM_BANK1231_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1231_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1232
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1232_DATA_W                                          32
#define RFC_ULLRAM_BANK1232_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1232_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1233
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1233_DATA_W                                          32
#define RFC_ULLRAM_BANK1233_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1233_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1234
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1234_DATA_W                                          32
#define RFC_ULLRAM_BANK1234_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1234_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1235
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1235_DATA_W                                          32
#define RFC_ULLRAM_BANK1235_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1235_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1236
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1236_DATA_W                                          32
#define RFC_ULLRAM_BANK1236_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1236_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1237
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1237_DATA_W                                          32
#define RFC_ULLRAM_BANK1237_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1237_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1238
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1238_DATA_W                                          32
#define RFC_ULLRAM_BANK1238_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1238_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1239
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1239_DATA_W                                          32
#define RFC_ULLRAM_BANK1239_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1239_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1240
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1240_DATA_W                                          32
#define RFC_ULLRAM_BANK1240_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1240_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1241
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1241_DATA_W                                          32
#define RFC_ULLRAM_BANK1241_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1241_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1242
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1242_DATA_W                                          32
#define RFC_ULLRAM_BANK1242_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1242_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1243
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1243_DATA_W                                          32
#define RFC_ULLRAM_BANK1243_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1243_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1244
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1244_DATA_W                                          32
#define RFC_ULLRAM_BANK1244_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1244_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1245
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1245_DATA_W                                          32
#define RFC_ULLRAM_BANK1245_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1245_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1246
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1246_DATA_W                                          32
#define RFC_ULLRAM_BANK1246_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1246_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1247
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1247_DATA_W                                          32
#define RFC_ULLRAM_BANK1247_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1247_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1248
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1248_DATA_W                                          32
#define RFC_ULLRAM_BANK1248_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1248_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1249
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1249_DATA_W                                          32
#define RFC_ULLRAM_BANK1249_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1249_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1250
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1250_DATA_W                                          32
#define RFC_ULLRAM_BANK1250_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1250_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1251
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1251_DATA_W                                          32
#define RFC_ULLRAM_BANK1251_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1251_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1252
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1252_DATA_W                                          32
#define RFC_ULLRAM_BANK1252_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1252_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1253
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1253_DATA_W                                          32
#define RFC_ULLRAM_BANK1253_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1253_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1254
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1254_DATA_W                                          32
#define RFC_ULLRAM_BANK1254_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1254_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1255
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1255_DATA_W                                          32
#define RFC_ULLRAM_BANK1255_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1255_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1256
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1256_DATA_W                                          32
#define RFC_ULLRAM_BANK1256_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1256_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1257
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1257_DATA_W                                          32
#define RFC_ULLRAM_BANK1257_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1257_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1258
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1258_DATA_W                                          32
#define RFC_ULLRAM_BANK1258_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1258_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1259
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1259_DATA_W                                          32
#define RFC_ULLRAM_BANK1259_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1259_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1260
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1260_DATA_W                                          32
#define RFC_ULLRAM_BANK1260_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1260_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1261
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1261_DATA_W                                          32
#define RFC_ULLRAM_BANK1261_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1261_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1262
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1262_DATA_W                                          32
#define RFC_ULLRAM_BANK1262_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1262_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1263
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1263_DATA_W                                          32
#define RFC_ULLRAM_BANK1263_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1263_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1264
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1264_DATA_W                                          32
#define RFC_ULLRAM_BANK1264_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1264_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1265
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1265_DATA_W                                          32
#define RFC_ULLRAM_BANK1265_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1265_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1266
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1266_DATA_W                                          32
#define RFC_ULLRAM_BANK1266_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1266_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1267
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1267_DATA_W                                          32
#define RFC_ULLRAM_BANK1267_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1267_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1268
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1268_DATA_W                                          32
#define RFC_ULLRAM_BANK1268_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1268_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1269
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1269_DATA_W                                          32
#define RFC_ULLRAM_BANK1269_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1269_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1270
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1270_DATA_W                                          32
#define RFC_ULLRAM_BANK1270_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1270_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1271
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1271_DATA_W                                          32
#define RFC_ULLRAM_BANK1271_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1271_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1272
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1272_DATA_W                                          32
#define RFC_ULLRAM_BANK1272_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1272_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1273
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1273_DATA_W                                          32
#define RFC_ULLRAM_BANK1273_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1273_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1274
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1274_DATA_W                                          32
#define RFC_ULLRAM_BANK1274_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1274_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1275
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1275_DATA_W                                          32
#define RFC_ULLRAM_BANK1275_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1275_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1276
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1276_DATA_W                                          32
#define RFC_ULLRAM_BANK1276_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1276_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1277
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1277_DATA_W                                          32
#define RFC_ULLRAM_BANK1277_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1277_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1278
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1278_DATA_W                                          32
#define RFC_ULLRAM_BANK1278_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1278_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1279
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1279_DATA_W                                          32
#define RFC_ULLRAM_BANK1279_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1279_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1280
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1280_DATA_W                                          32
#define RFC_ULLRAM_BANK1280_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1280_DATA_S                                           0

