nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1281
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1281_DATA_W                                          32
#define RFC_ULLRAM_BANK1281_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1281_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1282
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1282_DATA_W                                          32
#define RFC_ULLRAM_BANK1282_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1282_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1283
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1283_DATA_W                                          32
#define RFC_ULLRAM_BANK1283_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1283_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1284
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1284_DATA_W                                          32
#define RFC_ULLRAM_BANK1284_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1284_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1285
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1285_DATA_W                                          32
#define RFC_ULLRAM_BANK1285_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1285_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1286
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1286_DATA_W                                          32
#define RFC_ULLRAM_BANK1286_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1286_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1287
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1287_DATA_W                                          32
#define RFC_ULLRAM_BANK1287_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1287_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1288
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1288_DATA_W                                          32
#define RFC_ULLRAM_BANK1288_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1288_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1289
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1289_DATA_W                                          32
#define RFC_ULLRAM_BANK1289_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1289_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1290
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1290_DATA_W                                          32
#define RFC_ULLRAM_BANK1290_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1290_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1291
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1291_DATA_W                                          32
#define RFC_ULLRAM_BANK1291_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1291_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1292
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1292_DATA_W                                          32
#define RFC_ULLRAM_BANK1292_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1292_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1293
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1293_DATA_W                                          32
#define RFC_ULLRAM_BANK1293_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1293_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1294
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1294_DATA_W                                          32
#define RFC_ULLRAM_BANK1294_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1294_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1295
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1295_DATA_W                                          32
#define RFC_ULLRAM_BANK1295_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1295_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1296
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1296_DATA_W                                          32
#define RFC_ULLRAM_BANK1296_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1296_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1297
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1297_DATA_W                                          32
#define RFC_ULLRAM_BANK1297_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1297_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1298
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1298_DATA_W                                          32
#define RFC_ULLRAM_BANK1298_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1298_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1299
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1299_DATA_W                                          32
#define RFC_ULLRAM_BANK1299_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1299_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1300
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1300_DATA_W                                          32
#define RFC_ULLRAM_BANK1300_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1300_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1301
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1301_DATA_W                                          32
#define RFC_ULLRAM_BANK1301_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1301_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1302
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1302_DATA_W                                          32
#define RFC_ULLRAM_BANK1302_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1302_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1303
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1303_DATA_W                                          32
#define RFC_ULLRAM_BANK1303_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1303_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1304
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1304_DATA_W                                          32
#define RFC_ULLRAM_BANK1304_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1304_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1305
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1305_DATA_W                                          32
#define RFC_ULLRAM_BANK1305_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1305_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1306
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1306_DATA_W                                          32
#define RFC_ULLRAM_BANK1306_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1306_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1307
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1307_DATA_W                                          32
#define RFC_ULLRAM_BANK1307_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1307_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1308
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1308_DATA_W                                          32
#define RFC_ULLRAM_BANK1308_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1308_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1309
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1309_DATA_W                                          32
#define RFC_ULLRAM_BANK1309_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1309_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1310
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1310_DATA_W                                          32
#define RFC_ULLRAM_BANK1310_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1310_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1311
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1311_DATA_W                                          32
#define RFC_ULLRAM_BANK1311_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1311_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1312
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1312_DATA_W                                          32
#define RFC_ULLRAM_BANK1312_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1312_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1313
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1313_DATA_W                                          32
#define RFC_ULLRAM_BANK1313_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1313_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1314
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1314_DATA_W                                          32
#define RFC_ULLRAM_BANK1314_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1314_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1315
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1315_DATA_W                                          32
#define RFC_ULLRAM_BANK1315_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1315_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1316
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1316_DATA_W                                          32
#define RFC_ULLRAM_BANK1316_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1316_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1317
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1317_DATA_W                                          32
#define RFC_ULLRAM_BANK1317_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1317_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1318
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1318_DATA_W                                          32
#define RFC_ULLRAM_BANK1318_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1318_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1319
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1319_DATA_W                                          32
#define RFC_ULLRAM_BANK1319_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1319_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1320
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1320_DATA_W                                          32
#define RFC_ULLRAM_BANK1320_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1320_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1321
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1321_DATA_W                                          32
#define RFC_ULLRAM_BANK1321_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1321_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1322
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1322_DATA_W                                          32
#define RFC_ULLRAM_BANK1322_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1322_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1323
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1323_DATA_W                                          32
#define RFC_ULLRAM_BANK1323_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1323_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1324
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1324_DATA_W                                          32
#define RFC_ULLRAM_BANK1324_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1324_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1325
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1325_DATA_W                                          32
#define RFC_ULLRAM_BANK1325_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1325_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1326
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1326_DATA_W                                          32
#define RFC_ULLRAM_BANK1326_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1326_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1327
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1327_DATA_W                                          32
#define RFC_ULLRAM_BANK1327_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1327_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1328
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1328_DATA_W                                          32
#define RFC_ULLRAM_BANK1328_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1328_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1329
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1329_DATA_W                                          32
#define RFC_ULLRAM_BANK1329_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1329_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1330
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1330_DATA_W                                          32
#define RFC_ULLRAM_BANK1330_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1330_DATA_S                                           0

