nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1431
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1431_DATA_W                                          32
#define RFC_ULLRAM_BANK1431_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1431_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1432
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1432_DATA_W                                          32
#define RFC_ULLRAM_BANK1432_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1432_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1433
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1433_DATA_W                                          32
#define RFC_ULLRAM_BANK1433_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1433_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1434
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1434_DATA_W                                          32
#define RFC_ULLRAM_BANK1434_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1434_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1435
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1435_DATA_W                                          32
#define RFC_ULLRAM_BANK1435_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1435_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1436
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1436_DATA_W                                          32
#define RFC_ULLRAM_BANK1436_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1436_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1437
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1437_DATA_W                                          32
#define RFC_ULLRAM_BANK1437_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1437_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1438
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1438_DATA_W                                          32
#define RFC_ULLRAM_BANK1438_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1438_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1439
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1439_DATA_W                                          32
#define RFC_ULLRAM_BANK1439_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1439_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1440
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1440_DATA_W                                          32
#define RFC_ULLRAM_BANK1440_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1440_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1441
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1441_DATA_W                                          32
#define RFC_ULLRAM_BANK1441_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1441_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1442
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1442_DATA_W                                          32
#define RFC_ULLRAM_BANK1442_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1442_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1443
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1443_DATA_W                                          32
#define RFC_ULLRAM_BANK1443_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1443_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1444
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1444_DATA_W                                          32
#define RFC_ULLRAM_BANK1444_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1444_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1445
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1445_DATA_W                                          32
#define RFC_ULLRAM_BANK1445_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1445_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1446
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1446_DATA_W                                          32
#define RFC_ULLRAM_BANK1446_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1446_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1447
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1447_DATA_W                                          32
#define RFC_ULLRAM_BANK1447_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1447_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1448
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1448_DATA_W                                          32
#define RFC_ULLRAM_BANK1448_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1448_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1449
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1449_DATA_W                                          32
#define RFC_ULLRAM_BANK1449_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1449_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1450
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1450_DATA_W                                          32
#define RFC_ULLRAM_BANK1450_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1450_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1451
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1451_DATA_W                                          32
#define RFC_ULLRAM_BANK1451_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1451_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1452
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1452_DATA_W                                          32
#define RFC_ULLRAM_BANK1452_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1452_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1453
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1453_DATA_W                                          32
#define RFC_ULLRAM_BANK1453_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1453_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1454
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1454_DATA_W                                          32
#define RFC_ULLRAM_BANK1454_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1454_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1455
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1455_DATA_W                                          32
#define RFC_ULLRAM_BANK1455_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1455_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1456
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1456_DATA_W                                          32
#define RFC_ULLRAM_BANK1456_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1456_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1457
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1457_DATA_W                                          32
#define RFC_ULLRAM_BANK1457_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1457_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1458
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1458_DATA_W                                          32
#define RFC_ULLRAM_BANK1458_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1458_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1459
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1459_DATA_W                                          32
#define RFC_ULLRAM_BANK1459_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1459_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1460
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1460_DATA_W                                          32
#define RFC_ULLRAM_BANK1460_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1460_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1461
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1461_DATA_W                                          32
#define RFC_ULLRAM_BANK1461_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1461_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1462
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1462_DATA_W                                          32
#define RFC_ULLRAM_BANK1462_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1462_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1463
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1463_DATA_W                                          32
#define RFC_ULLRAM_BANK1463_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1463_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1464
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1464_DATA_W                                          32
#define RFC_ULLRAM_BANK1464_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1464_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1465
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1465_DATA_W                                          32
#define RFC_ULLRAM_BANK1465_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1465_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1466
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1466_DATA_W                                          32
#define RFC_ULLRAM_BANK1466_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1466_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1467
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1467_DATA_W                                          32
#define RFC_ULLRAM_BANK1467_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1467_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1468
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1468_DATA_W                                          32
#define RFC_ULLRAM_BANK1468_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1468_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1469
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1469_DATA_W                                          32
#define RFC_ULLRAM_BANK1469_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1469_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1470
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1470_DATA_W                                          32
#define RFC_ULLRAM_BANK1470_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1470_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1471
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1471_DATA_W                                          32
#define RFC_ULLRAM_BANK1471_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1471_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1472
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1472_DATA_W                                          32
#define RFC_ULLRAM_BANK1472_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1472_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1473
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1473_DATA_W                                          32
#define RFC_ULLRAM_BANK1473_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1473_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1474
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1474_DATA_W                                          32
#define RFC_ULLRAM_BANK1474_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1474_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1475
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1475_DATA_W                                          32
#define RFC_ULLRAM_BANK1475_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1475_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1476
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1476_DATA_W                                          32
#define RFC_ULLRAM_BANK1476_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1476_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1477
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1477_DATA_W                                          32
#define RFC_ULLRAM_BANK1477_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1477_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1478
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1478_DATA_W                                          32
#define RFC_ULLRAM_BANK1478_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1478_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1479
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1479_DATA_W                                          32
#define RFC_ULLRAM_BANK1479_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1479_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1480
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1480_DATA_W                                          32
#define RFC_ULLRAM_BANK1480_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1480_DATA_S                                           0

