nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1531
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1531_DATA_W                                          32
#define RFC_ULLRAM_BANK1531_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1531_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1532
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1532_DATA_W                                          32
#define RFC_ULLRAM_BANK1532_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1532_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1533
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1533_DATA_W                                          32
#define RFC_ULLRAM_BANK1533_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1533_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1534
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1534_DATA_W                                          32
#define RFC_ULLRAM_BANK1534_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1534_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1535
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1535_DATA_W                                          32
#define RFC_ULLRAM_BANK1535_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1535_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1536
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1536_DATA_W                                          32
#define RFC_ULLRAM_BANK1536_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1536_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1537
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1537_DATA_W                                          32
#define RFC_ULLRAM_BANK1537_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1537_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1538
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1538_DATA_W                                          32
#define RFC_ULLRAM_BANK1538_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1538_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1539
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1539_DATA_W                                          32
#define RFC_ULLRAM_BANK1539_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1539_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1540
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1540_DATA_W                                          32
#define RFC_ULLRAM_BANK1540_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1540_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1541
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1541_DATA_W                                          32
#define RFC_ULLRAM_BANK1541_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1541_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1542
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1542_DATA_W                                          32
#define RFC_ULLRAM_BANK1542_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1542_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1543
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1543_DATA_W                                          32
#define RFC_ULLRAM_BANK1543_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1543_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1544
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1544_DATA_W                                          32
#define RFC_ULLRAM_BANK1544_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1544_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1545
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1545_DATA_W                                          32
#define RFC_ULLRAM_BANK1545_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1545_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1546
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1546_DATA_W                                          32
#define RFC_ULLRAM_BANK1546_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1546_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1547
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1547_DATA_W                                          32
#define RFC_ULLRAM_BANK1547_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1547_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1548
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1548_DATA_W                                          32
#define RFC_ULLRAM_BANK1548_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1548_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1549
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1549_DATA_W                                          32
#define RFC_ULLRAM_BANK1549_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1549_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1550
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1550_DATA_W                                          32
#define RFC_ULLRAM_BANK1550_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1550_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1551
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1551_DATA_W                                          32
#define RFC_ULLRAM_BANK1551_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1551_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1552
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1552_DATA_W                                          32
#define RFC_ULLRAM_BANK1552_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1552_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1553
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1553_DATA_W                                          32
#define RFC_ULLRAM_BANK1553_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1553_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1554
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1554_DATA_W                                          32
#define RFC_ULLRAM_BANK1554_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1554_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1555
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1555_DATA_W                                          32
#define RFC_ULLRAM_BANK1555_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1555_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1556
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1556_DATA_W                                          32
#define RFC_ULLRAM_BANK1556_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1556_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1557
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1557_DATA_W                                          32
#define RFC_ULLRAM_BANK1557_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1557_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1558
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1558_DATA_W                                          32
#define RFC_ULLRAM_BANK1558_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1558_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1559
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1559_DATA_W                                          32
#define RFC_ULLRAM_BANK1559_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1559_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1560
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1560_DATA_W                                          32
#define RFC_ULLRAM_BANK1560_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1560_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1561
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1561_DATA_W                                          32
#define RFC_ULLRAM_BANK1561_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1561_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1562
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1562_DATA_W                                          32
#define RFC_ULLRAM_BANK1562_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1562_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1563
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1563_DATA_W                                          32
#define RFC_ULLRAM_BANK1563_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1563_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1564
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1564_DATA_W                                          32
#define RFC_ULLRAM_BANK1564_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1564_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1565
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1565_DATA_W                                          32
#define RFC_ULLRAM_BANK1565_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1565_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1566
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1566_DATA_W                                          32
#define RFC_ULLRAM_BANK1566_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1566_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1567
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1567_DATA_W                                          32
#define RFC_ULLRAM_BANK1567_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1567_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1568
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1568_DATA_W                                          32
#define RFC_ULLRAM_BANK1568_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1568_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1569
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1569_DATA_W                                          32
#define RFC_ULLRAM_BANK1569_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1569_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1570
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1570_DATA_W                                          32
#define RFC_ULLRAM_BANK1570_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1570_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1571
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1571_DATA_W                                          32
#define RFC_ULLRAM_BANK1571_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1571_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1572
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1572_DATA_W                                          32
#define RFC_ULLRAM_BANK1572_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1572_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1573
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1573_DATA_W                                          32
#define RFC_ULLRAM_BANK1573_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1573_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1574
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1574_DATA_W                                          32
#define RFC_ULLRAM_BANK1574_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1574_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1575
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1575_DATA_W                                          32
#define RFC_ULLRAM_BANK1575_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1575_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1576
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1576_DATA_W                                          32
#define RFC_ULLRAM_BANK1576_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1576_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1577
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1577_DATA_W                                          32
#define RFC_ULLRAM_BANK1577_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1577_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1578
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1578_DATA_W                                          32
#define RFC_ULLRAM_BANK1578_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1578_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1579
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1579_DATA_W                                          32
#define RFC_ULLRAM_BANK1579_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1579_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1580
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1580_DATA_W                                          32
#define RFC_ULLRAM_BANK1580_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1580_DATA_S                                           0

