nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1831
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1831_DATA_W                                          32
#define RFC_ULLRAM_BANK1831_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1831_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1832
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1832_DATA_W                                          32
#define RFC_ULLRAM_BANK1832_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1832_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1833
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1833_DATA_W                                          32
#define RFC_ULLRAM_BANK1833_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1833_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1834
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1834_DATA_W                                          32
#define RFC_ULLRAM_BANK1834_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1834_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1835
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1835_DATA_W                                          32
#define RFC_ULLRAM_BANK1835_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1835_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1836
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1836_DATA_W                                          32
#define RFC_ULLRAM_BANK1836_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1836_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1837
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1837_DATA_W                                          32
#define RFC_ULLRAM_BANK1837_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1837_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1838
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1838_DATA_W                                          32
#define RFC_ULLRAM_BANK1838_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1838_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1839
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1839_DATA_W                                          32
#define RFC_ULLRAM_BANK1839_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1839_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1840
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1840_DATA_W                                          32
#define RFC_ULLRAM_BANK1840_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1840_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1841
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1841_DATA_W                                          32
#define RFC_ULLRAM_BANK1841_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1841_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1842
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1842_DATA_W                                          32
#define RFC_ULLRAM_BANK1842_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1842_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1843
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1843_DATA_W                                          32
#define RFC_ULLRAM_BANK1843_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1843_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1844
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1844_DATA_W                                          32
#define RFC_ULLRAM_BANK1844_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1844_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1845
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1845_DATA_W                                          32
#define RFC_ULLRAM_BANK1845_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1845_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1846
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1846_DATA_W                                          32
#define RFC_ULLRAM_BANK1846_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1846_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1847
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1847_DATA_W                                          32
#define RFC_ULLRAM_BANK1847_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1847_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1848
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1848_DATA_W                                          32
#define RFC_ULLRAM_BANK1848_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1848_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1849
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1849_DATA_W                                          32
#define RFC_ULLRAM_BANK1849_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1849_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1850
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1850_DATA_W                                          32
#define RFC_ULLRAM_BANK1850_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1850_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1851
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1851_DATA_W                                          32
#define RFC_ULLRAM_BANK1851_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1851_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1852
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1852_DATA_W                                          32
#define RFC_ULLRAM_BANK1852_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1852_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1853
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1853_DATA_W                                          32
#define RFC_ULLRAM_BANK1853_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1853_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1854
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1854_DATA_W                                          32
#define RFC_ULLRAM_BANK1854_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1854_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1855
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1855_DATA_W                                          32
#define RFC_ULLRAM_BANK1855_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1855_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1856
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1856_DATA_W                                          32
#define RFC_ULLRAM_BANK1856_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1856_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1857
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1857_DATA_W                                          32
#define RFC_ULLRAM_BANK1857_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1857_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1858
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1858_DATA_W                                          32
#define RFC_ULLRAM_BANK1858_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1858_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1859
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1859_DATA_W                                          32
#define RFC_ULLRAM_BANK1859_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1859_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1860
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1860_DATA_W                                          32
#define RFC_ULLRAM_BANK1860_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1860_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1861
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1861_DATA_W                                          32
#define RFC_ULLRAM_BANK1861_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1861_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1862
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1862_DATA_W                                          32
#define RFC_ULLRAM_BANK1862_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1862_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1863
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1863_DATA_W                                          32
#define RFC_ULLRAM_BANK1863_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1863_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1864
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1864_DATA_W                                          32
#define RFC_ULLRAM_BANK1864_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1864_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1865
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1865_DATA_W                                          32
#define RFC_ULLRAM_BANK1865_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1865_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1866
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1866_DATA_W                                          32
#define RFC_ULLRAM_BANK1866_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1866_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1867
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1867_DATA_W                                          32
#define RFC_ULLRAM_BANK1867_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1867_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1868
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1868_DATA_W                                          32
#define RFC_ULLRAM_BANK1868_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1868_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1869
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1869_DATA_W                                          32
#define RFC_ULLRAM_BANK1869_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1869_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1870
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1870_DATA_W                                          32
#define RFC_ULLRAM_BANK1870_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1870_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1871
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1871_DATA_W                                          32
#define RFC_ULLRAM_BANK1871_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1871_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1872
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1872_DATA_W                                          32
#define RFC_ULLRAM_BANK1872_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1872_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1873
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1873_DATA_W                                          32
#define RFC_ULLRAM_BANK1873_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1873_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1874
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1874_DATA_W                                          32
#define RFC_ULLRAM_BANK1874_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1874_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1875
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1875_DATA_W                                          32
#define RFC_ULLRAM_BANK1875_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1875_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1876
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1876_DATA_W                                          32
#define RFC_ULLRAM_BANK1876_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1876_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1877
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1877_DATA_W                                          32
#define RFC_ULLRAM_BANK1877_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1877_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1878
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1878_DATA_W                                          32
#define RFC_ULLRAM_BANK1878_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1878_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1879
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1879_DATA_W                                          32
#define RFC_ULLRAM_BANK1879_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1879_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1880
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1880_DATA_W                                          32
#define RFC_ULLRAM_BANK1880_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1880_DATA_S                                           0

