nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1931
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1931_DATA_W                                          32
#define RFC_ULLRAM_BANK1931_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1931_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1932
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1932_DATA_W                                          32
#define RFC_ULLRAM_BANK1932_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1932_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1933
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1933_DATA_W                                          32
#define RFC_ULLRAM_BANK1933_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1933_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1934
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1934_DATA_W                                          32
#define RFC_ULLRAM_BANK1934_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1934_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1935
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1935_DATA_W                                          32
#define RFC_ULLRAM_BANK1935_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1935_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1936
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1936_DATA_W                                          32
#define RFC_ULLRAM_BANK1936_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1936_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1937
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1937_DATA_W                                          32
#define RFC_ULLRAM_BANK1937_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1937_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1938
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1938_DATA_W                                          32
#define RFC_ULLRAM_BANK1938_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1938_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1939
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1939_DATA_W                                          32
#define RFC_ULLRAM_BANK1939_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1939_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1940
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1940_DATA_W                                          32
#define RFC_ULLRAM_BANK1940_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1940_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1941
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1941_DATA_W                                          32
#define RFC_ULLRAM_BANK1941_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1941_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1942
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1942_DATA_W                                          32
#define RFC_ULLRAM_BANK1942_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1942_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1943
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1943_DATA_W                                          32
#define RFC_ULLRAM_BANK1943_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1943_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1944
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1944_DATA_W                                          32
#define RFC_ULLRAM_BANK1944_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1944_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1945
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1945_DATA_W                                          32
#define RFC_ULLRAM_BANK1945_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1945_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1946
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1946_DATA_W                                          32
#define RFC_ULLRAM_BANK1946_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1946_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1947
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1947_DATA_W                                          32
#define RFC_ULLRAM_BANK1947_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1947_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1948
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1948_DATA_W                                          32
#define RFC_ULLRAM_BANK1948_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1948_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1949
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1949_DATA_W                                          32
#define RFC_ULLRAM_BANK1949_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1949_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1950
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1950_DATA_W                                          32
#define RFC_ULLRAM_BANK1950_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1950_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1951
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1951_DATA_W                                          32
#define RFC_ULLRAM_BANK1951_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1951_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1952
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1952_DATA_W                                          32
#define RFC_ULLRAM_BANK1952_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1952_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1953
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1953_DATA_W                                          32
#define RFC_ULLRAM_BANK1953_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1953_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1954
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1954_DATA_W                                          32
#define RFC_ULLRAM_BANK1954_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1954_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1955
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1955_DATA_W                                          32
#define RFC_ULLRAM_BANK1955_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1955_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1956
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1956_DATA_W                                          32
#define RFC_ULLRAM_BANK1956_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1956_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1957
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1957_DATA_W                                          32
#define RFC_ULLRAM_BANK1957_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1957_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1958
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1958_DATA_W                                          32
#define RFC_ULLRAM_BANK1958_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1958_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1959
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1959_DATA_W                                          32
#define RFC_ULLRAM_BANK1959_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1959_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1960
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1960_DATA_W                                          32
#define RFC_ULLRAM_BANK1960_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1960_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1961
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1961_DATA_W                                          32
#define RFC_ULLRAM_BANK1961_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1961_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1962
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1962_DATA_W                                          32
#define RFC_ULLRAM_BANK1962_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1962_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1963
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1963_DATA_W                                          32
#define RFC_ULLRAM_BANK1963_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1963_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1964
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1964_DATA_W                                          32
#define RFC_ULLRAM_BANK1964_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1964_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1965
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1965_DATA_W                                          32
#define RFC_ULLRAM_BANK1965_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1965_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1966
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1966_DATA_W                                          32
#define RFC_ULLRAM_BANK1966_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1966_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1967
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1967_DATA_W                                          32
#define RFC_ULLRAM_BANK1967_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1967_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1968
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1968_DATA_W                                          32
#define RFC_ULLRAM_BANK1968_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1968_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1969
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1969_DATA_W                                          32
#define RFC_ULLRAM_BANK1969_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1969_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1970
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1970_DATA_W                                          32
#define RFC_ULLRAM_BANK1970_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1970_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1971
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1971_DATA_W                                          32
#define RFC_ULLRAM_BANK1971_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1971_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1972
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1972_DATA_W                                          32
#define RFC_ULLRAM_BANK1972_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1972_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1973
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1973_DATA_W                                          32
#define RFC_ULLRAM_BANK1973_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1973_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1974
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1974_DATA_W                                          32
#define RFC_ULLRAM_BANK1974_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1974_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1975
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1975_DATA_W                                          32
#define RFC_ULLRAM_BANK1975_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1975_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1976
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1976_DATA_W                                          32
#define RFC_ULLRAM_BANK1976_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1976_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1977
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1977_DATA_W                                          32
#define RFC_ULLRAM_BANK1977_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1977_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1978
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1978_DATA_W                                          32
#define RFC_ULLRAM_BANK1978_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1978_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1979
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1979_DATA_W                                          32
#define RFC_ULLRAM_BANK1979_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1979_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1980
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1980_DATA_W                                          32
#define RFC_ULLRAM_BANK1980_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1980_DATA_S                                           0

