nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11131
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11131_DATA_W                                         32
#define RFC_ULLRAM_BANK11131_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11131_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11132
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11132_DATA_W                                         32
#define RFC_ULLRAM_BANK11132_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11132_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11133
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11133_DATA_W                                         32
#define RFC_ULLRAM_BANK11133_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11133_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11134
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11134_DATA_W                                         32
#define RFC_ULLRAM_BANK11134_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11134_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11135
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11135_DATA_W                                         32
#define RFC_ULLRAM_BANK11135_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11135_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11136
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11136_DATA_W                                         32
#define RFC_ULLRAM_BANK11136_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11136_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11137
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11137_DATA_W                                         32
#define RFC_ULLRAM_BANK11137_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11137_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11138
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11138_DATA_W                                         32
#define RFC_ULLRAM_BANK11138_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11138_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11139
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11139_DATA_W                                         32
#define RFC_ULLRAM_BANK11139_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11139_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11140
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11140_DATA_W                                         32
#define RFC_ULLRAM_BANK11140_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11140_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11141
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11141_DATA_W                                         32
#define RFC_ULLRAM_BANK11141_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11141_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11142
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11142_DATA_W                                         32
#define RFC_ULLRAM_BANK11142_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11142_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11143
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11143_DATA_W                                         32
#define RFC_ULLRAM_BANK11143_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11143_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11144
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11144_DATA_W                                         32
#define RFC_ULLRAM_BANK11144_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11144_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11145
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11145_DATA_W                                         32
#define RFC_ULLRAM_BANK11145_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11145_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11146
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11146_DATA_W                                         32
#define RFC_ULLRAM_BANK11146_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11146_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11147
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11147_DATA_W                                         32
#define RFC_ULLRAM_BANK11147_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11147_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11148
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11148_DATA_W                                         32
#define RFC_ULLRAM_BANK11148_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11148_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11149
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11149_DATA_W                                         32
#define RFC_ULLRAM_BANK11149_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11149_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11150
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11150_DATA_W                                         32
#define RFC_ULLRAM_BANK11150_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11150_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11151
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11151_DATA_W                                         32
#define RFC_ULLRAM_BANK11151_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11151_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11152
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11152_DATA_W                                         32
#define RFC_ULLRAM_BANK11152_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11152_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11153
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11153_DATA_W                                         32
#define RFC_ULLRAM_BANK11153_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11153_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11154
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11154_DATA_W                                         32
#define RFC_ULLRAM_BANK11154_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11154_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11155
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11155_DATA_W                                         32
#define RFC_ULLRAM_BANK11155_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11155_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11156
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11156_DATA_W                                         32
#define RFC_ULLRAM_BANK11156_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11156_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11157
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11157_DATA_W                                         32
#define RFC_ULLRAM_BANK11157_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11157_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11158
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11158_DATA_W                                         32
#define RFC_ULLRAM_BANK11158_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11158_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11159
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11159_DATA_W                                         32
#define RFC_ULLRAM_BANK11159_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11159_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11160
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11160_DATA_W                                         32
#define RFC_ULLRAM_BANK11160_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11160_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11161
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11161_DATA_W                                         32
#define RFC_ULLRAM_BANK11161_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11161_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11162
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11162_DATA_W                                         32
#define RFC_ULLRAM_BANK11162_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11162_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11163
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11163_DATA_W                                         32
#define RFC_ULLRAM_BANK11163_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11163_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11164
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11164_DATA_W                                         32
#define RFC_ULLRAM_BANK11164_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11164_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11165
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11165_DATA_W                                         32
#define RFC_ULLRAM_BANK11165_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11165_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11166
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11166_DATA_W                                         32
#define RFC_ULLRAM_BANK11166_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11166_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11167
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11167_DATA_W                                         32
#define RFC_ULLRAM_BANK11167_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11167_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11168
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11168_DATA_W                                         32
#define RFC_ULLRAM_BANK11168_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11168_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11169
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11169_DATA_W                                         32
#define RFC_ULLRAM_BANK11169_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11169_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11170
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11170_DATA_W                                         32
#define RFC_ULLRAM_BANK11170_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11170_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11171
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11171_DATA_W                                         32
#define RFC_ULLRAM_BANK11171_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11171_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11172
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11172_DATA_W                                         32
#define RFC_ULLRAM_BANK11172_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11172_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11173
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11173_DATA_W                                         32
#define RFC_ULLRAM_BANK11173_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11173_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11174
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11174_DATA_W                                         32
#define RFC_ULLRAM_BANK11174_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11174_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11175
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11175_DATA_W                                         32
#define RFC_ULLRAM_BANK11175_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11175_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11176
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11176_DATA_W                                         32
#define RFC_ULLRAM_BANK11176_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11176_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11177
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11177_DATA_W                                         32
#define RFC_ULLRAM_BANK11177_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11177_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11178
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11178_DATA_W                                         32
#define RFC_ULLRAM_BANK11178_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11178_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11179
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11179_DATA_W                                         32
#define RFC_ULLRAM_BANK11179_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11179_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11180
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11180_DATA_W                                         32
#define RFC_ULLRAM_BANK11180_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11180_DATA_S                                          0

