nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11281
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11281_DATA_W                                         32
#define RFC_ULLRAM_BANK11281_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11281_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11282
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11282_DATA_W                                         32
#define RFC_ULLRAM_BANK11282_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11282_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11283
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11283_DATA_W                                         32
#define RFC_ULLRAM_BANK11283_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11283_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11284
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11284_DATA_W                                         32
#define RFC_ULLRAM_BANK11284_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11284_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11285
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11285_DATA_W                                         32
#define RFC_ULLRAM_BANK11285_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11285_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11286
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11286_DATA_W                                         32
#define RFC_ULLRAM_BANK11286_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11286_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11287
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11287_DATA_W                                         32
#define RFC_ULLRAM_BANK11287_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11287_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11288
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11288_DATA_W                                         32
#define RFC_ULLRAM_BANK11288_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11288_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11289
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11289_DATA_W                                         32
#define RFC_ULLRAM_BANK11289_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11289_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11290
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11290_DATA_W                                         32
#define RFC_ULLRAM_BANK11290_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11290_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11291
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11291_DATA_W                                         32
#define RFC_ULLRAM_BANK11291_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11291_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11292
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11292_DATA_W                                         32
#define RFC_ULLRAM_BANK11292_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11292_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11293
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11293_DATA_W                                         32
#define RFC_ULLRAM_BANK11293_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11293_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11294
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11294_DATA_W                                         32
#define RFC_ULLRAM_BANK11294_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11294_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11295
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11295_DATA_W                                         32
#define RFC_ULLRAM_BANK11295_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11295_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11296
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11296_DATA_W                                         32
#define RFC_ULLRAM_BANK11296_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11296_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11297
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11297_DATA_W                                         32
#define RFC_ULLRAM_BANK11297_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11297_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11298
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11298_DATA_W                                         32
#define RFC_ULLRAM_BANK11298_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11298_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11299
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11299_DATA_W                                         32
#define RFC_ULLRAM_BANK11299_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11299_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11300
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11300_DATA_W                                         32
#define RFC_ULLRAM_BANK11300_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11300_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11301
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11301_DATA_W                                         32
#define RFC_ULLRAM_BANK11301_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11301_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11302
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11302_DATA_W                                         32
#define RFC_ULLRAM_BANK11302_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11302_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11303
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11303_DATA_W                                         32
#define RFC_ULLRAM_BANK11303_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11303_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11304
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11304_DATA_W                                         32
#define RFC_ULLRAM_BANK11304_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11304_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11305
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11305_DATA_W                                         32
#define RFC_ULLRAM_BANK11305_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11305_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11306
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11306_DATA_W                                         32
#define RFC_ULLRAM_BANK11306_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11306_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11307
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11307_DATA_W                                         32
#define RFC_ULLRAM_BANK11307_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11307_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11308
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11308_DATA_W                                         32
#define RFC_ULLRAM_BANK11308_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11308_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11309
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11309_DATA_W                                         32
#define RFC_ULLRAM_BANK11309_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11309_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11310
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11310_DATA_W                                         32
#define RFC_ULLRAM_BANK11310_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11310_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11311
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11311_DATA_W                                         32
#define RFC_ULLRAM_BANK11311_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11311_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11312
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11312_DATA_W                                         32
#define RFC_ULLRAM_BANK11312_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11312_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11313
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11313_DATA_W                                         32
#define RFC_ULLRAM_BANK11313_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11313_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11314
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11314_DATA_W                                         32
#define RFC_ULLRAM_BANK11314_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11314_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11315
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11315_DATA_W                                         32
#define RFC_ULLRAM_BANK11315_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11315_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11316
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11316_DATA_W                                         32
#define RFC_ULLRAM_BANK11316_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11316_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11317
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11317_DATA_W                                         32
#define RFC_ULLRAM_BANK11317_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11317_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11318
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11318_DATA_W                                         32
#define RFC_ULLRAM_BANK11318_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11318_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11319
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11319_DATA_W                                         32
#define RFC_ULLRAM_BANK11319_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11319_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11320
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11320_DATA_W                                         32
#define RFC_ULLRAM_BANK11320_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11320_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11321
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11321_DATA_W                                         32
#define RFC_ULLRAM_BANK11321_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11321_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11322
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11322_DATA_W                                         32
#define RFC_ULLRAM_BANK11322_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11322_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11323
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11323_DATA_W                                         32
#define RFC_ULLRAM_BANK11323_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11323_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11324
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11324_DATA_W                                         32
#define RFC_ULLRAM_BANK11324_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11324_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11325
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11325_DATA_W                                         32
#define RFC_ULLRAM_BANK11325_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11325_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11326
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11326_DATA_W                                         32
#define RFC_ULLRAM_BANK11326_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11326_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11327
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11327_DATA_W                                         32
#define RFC_ULLRAM_BANK11327_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11327_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11328
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11328_DATA_W                                         32
#define RFC_ULLRAM_BANK11328_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11328_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11329
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11329_DATA_W                                         32
#define RFC_ULLRAM_BANK11329_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11329_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11330
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11330_DATA_W                                         32
#define RFC_ULLRAM_BANK11330_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11330_DATA_S                                          0

