nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11381
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11381_DATA_W                                         32
#define RFC_ULLRAM_BANK11381_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11381_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11382
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11382_DATA_W                                         32
#define RFC_ULLRAM_BANK11382_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11382_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11383
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11383_DATA_W                                         32
#define RFC_ULLRAM_BANK11383_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11383_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11384
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11384_DATA_W                                         32
#define RFC_ULLRAM_BANK11384_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11384_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11385
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11385_DATA_W                                         32
#define RFC_ULLRAM_BANK11385_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11385_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11386
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11386_DATA_W                                         32
#define RFC_ULLRAM_BANK11386_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11386_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11387
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11387_DATA_W                                         32
#define RFC_ULLRAM_BANK11387_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11387_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11388
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11388_DATA_W                                         32
#define RFC_ULLRAM_BANK11388_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11388_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11389
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11389_DATA_W                                         32
#define RFC_ULLRAM_BANK11389_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11389_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11390
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11390_DATA_W                                         32
#define RFC_ULLRAM_BANK11390_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11390_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11391
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11391_DATA_W                                         32
#define RFC_ULLRAM_BANK11391_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11391_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11392
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11392_DATA_W                                         32
#define RFC_ULLRAM_BANK11392_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11392_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11393
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11393_DATA_W                                         32
#define RFC_ULLRAM_BANK11393_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11393_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11394
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11394_DATA_W                                         32
#define RFC_ULLRAM_BANK11394_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11394_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11395
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11395_DATA_W                                         32
#define RFC_ULLRAM_BANK11395_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11395_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11396
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11396_DATA_W                                         32
#define RFC_ULLRAM_BANK11396_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11396_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11397
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11397_DATA_W                                         32
#define RFC_ULLRAM_BANK11397_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11397_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11398
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11398_DATA_W                                         32
#define RFC_ULLRAM_BANK11398_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11398_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11399
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11399_DATA_W                                         32
#define RFC_ULLRAM_BANK11399_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11399_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11400
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11400_DATA_W                                         32
#define RFC_ULLRAM_BANK11400_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11400_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11401
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11401_DATA_W                                         32
#define RFC_ULLRAM_BANK11401_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11401_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11402
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11402_DATA_W                                         32
#define RFC_ULLRAM_BANK11402_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11402_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11403
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11403_DATA_W                                         32
#define RFC_ULLRAM_BANK11403_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11403_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11404
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11404_DATA_W                                         32
#define RFC_ULLRAM_BANK11404_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11404_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11405
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11405_DATA_W                                         32
#define RFC_ULLRAM_BANK11405_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11405_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11406
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11406_DATA_W                                         32
#define RFC_ULLRAM_BANK11406_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11406_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11407
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11407_DATA_W                                         32
#define RFC_ULLRAM_BANK11407_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11407_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11408
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11408_DATA_W                                         32
#define RFC_ULLRAM_BANK11408_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11408_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11409
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11409_DATA_W                                         32
#define RFC_ULLRAM_BANK11409_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11409_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11410
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11410_DATA_W                                         32
#define RFC_ULLRAM_BANK11410_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11410_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11411
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11411_DATA_W                                         32
#define RFC_ULLRAM_BANK11411_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11411_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11412
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11412_DATA_W                                         32
#define RFC_ULLRAM_BANK11412_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11412_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11413
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11413_DATA_W                                         32
#define RFC_ULLRAM_BANK11413_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11413_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11414
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11414_DATA_W                                         32
#define RFC_ULLRAM_BANK11414_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11414_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11415
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11415_DATA_W                                         32
#define RFC_ULLRAM_BANK11415_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11415_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11416
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11416_DATA_W                                         32
#define RFC_ULLRAM_BANK11416_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11416_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11417
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11417_DATA_W                                         32
#define RFC_ULLRAM_BANK11417_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11417_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11418
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11418_DATA_W                                         32
#define RFC_ULLRAM_BANK11418_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11418_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11419
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11419_DATA_W                                         32
#define RFC_ULLRAM_BANK11419_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11419_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11420
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11420_DATA_W                                         32
#define RFC_ULLRAM_BANK11420_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11420_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11421
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11421_DATA_W                                         32
#define RFC_ULLRAM_BANK11421_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11421_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11422
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11422_DATA_W                                         32
#define RFC_ULLRAM_BANK11422_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11422_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11423
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11423_DATA_W                                         32
#define RFC_ULLRAM_BANK11423_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11423_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11424
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11424_DATA_W                                         32
#define RFC_ULLRAM_BANK11424_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11424_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11425
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11425_DATA_W                                         32
#define RFC_ULLRAM_BANK11425_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11425_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11426
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11426_DATA_W                                         32
#define RFC_ULLRAM_BANK11426_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11426_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11427
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11427_DATA_W                                         32
#define RFC_ULLRAM_BANK11427_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11427_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11428
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11428_DATA_W                                         32
#define RFC_ULLRAM_BANK11428_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11428_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11429
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11429_DATA_W                                         32
#define RFC_ULLRAM_BANK11429_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11429_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11430
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11430_DATA_W                                         32
#define RFC_ULLRAM_BANK11430_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11430_DATA_S                                          0

