nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11481
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11481_DATA_W                                         32
#define RFC_ULLRAM_BANK11481_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11481_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11482
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11482_DATA_W                                         32
#define RFC_ULLRAM_BANK11482_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11482_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11483
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11483_DATA_W                                         32
#define RFC_ULLRAM_BANK11483_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11483_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11484
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11484_DATA_W                                         32
#define RFC_ULLRAM_BANK11484_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11484_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11485
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11485_DATA_W                                         32
#define RFC_ULLRAM_BANK11485_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11485_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11486
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11486_DATA_W                                         32
#define RFC_ULLRAM_BANK11486_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11486_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11487
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11487_DATA_W                                         32
#define RFC_ULLRAM_BANK11487_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11487_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11488
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11488_DATA_W                                         32
#define RFC_ULLRAM_BANK11488_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11488_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11489
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11489_DATA_W                                         32
#define RFC_ULLRAM_BANK11489_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11489_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11490
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11490_DATA_W                                         32
#define RFC_ULLRAM_BANK11490_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11490_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11491
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11491_DATA_W                                         32
#define RFC_ULLRAM_BANK11491_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11491_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11492
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11492_DATA_W                                         32
#define RFC_ULLRAM_BANK11492_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11492_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11493
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11493_DATA_W                                         32
#define RFC_ULLRAM_BANK11493_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11493_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11494
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11494_DATA_W                                         32
#define RFC_ULLRAM_BANK11494_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11494_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11495
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11495_DATA_W                                         32
#define RFC_ULLRAM_BANK11495_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11495_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11496
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11496_DATA_W                                         32
#define RFC_ULLRAM_BANK11496_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11496_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11497
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11497_DATA_W                                         32
#define RFC_ULLRAM_BANK11497_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11497_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11498
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11498_DATA_W                                         32
#define RFC_ULLRAM_BANK11498_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11498_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11499
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11499_DATA_W                                         32
#define RFC_ULLRAM_BANK11499_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11499_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11500
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11500_DATA_W                                         32
#define RFC_ULLRAM_BANK11500_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11500_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11501
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11501_DATA_W                                         32
#define RFC_ULLRAM_BANK11501_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11501_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11502
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11502_DATA_W                                         32
#define RFC_ULLRAM_BANK11502_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11502_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11503
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11503_DATA_W                                         32
#define RFC_ULLRAM_BANK11503_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11503_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11504
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11504_DATA_W                                         32
#define RFC_ULLRAM_BANK11504_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11504_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11505
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11505_DATA_W                                         32
#define RFC_ULLRAM_BANK11505_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11505_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11506
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11506_DATA_W                                         32
#define RFC_ULLRAM_BANK11506_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11506_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11507
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11507_DATA_W                                         32
#define RFC_ULLRAM_BANK11507_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11507_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11508
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11508_DATA_W                                         32
#define RFC_ULLRAM_BANK11508_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11508_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11509
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11509_DATA_W                                         32
#define RFC_ULLRAM_BANK11509_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11509_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11510
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11510_DATA_W                                         32
#define RFC_ULLRAM_BANK11510_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11510_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11511
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11511_DATA_W                                         32
#define RFC_ULLRAM_BANK11511_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11511_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11512
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11512_DATA_W                                         32
#define RFC_ULLRAM_BANK11512_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11512_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11513
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11513_DATA_W                                         32
#define RFC_ULLRAM_BANK11513_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11513_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11514
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11514_DATA_W                                         32
#define RFC_ULLRAM_BANK11514_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11514_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11515
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11515_DATA_W                                         32
#define RFC_ULLRAM_BANK11515_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11515_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11516
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11516_DATA_W                                         32
#define RFC_ULLRAM_BANK11516_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11516_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11517
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11517_DATA_W                                         32
#define RFC_ULLRAM_BANK11517_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11517_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11518
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11518_DATA_W                                         32
#define RFC_ULLRAM_BANK11518_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11518_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11519
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11519_DATA_W                                         32
#define RFC_ULLRAM_BANK11519_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11519_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11520
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11520_DATA_W                                         32
#define RFC_ULLRAM_BANK11520_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11520_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11521
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11521_DATA_W                                         32
#define RFC_ULLRAM_BANK11521_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11521_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11522
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11522_DATA_W                                         32
#define RFC_ULLRAM_BANK11522_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11522_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11523
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11523_DATA_W                                         32
#define RFC_ULLRAM_BANK11523_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11523_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11524
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11524_DATA_W                                         32
#define RFC_ULLRAM_BANK11524_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11524_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11525
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11525_DATA_W                                         32
#define RFC_ULLRAM_BANK11525_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11525_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11526
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11526_DATA_W                                         32
#define RFC_ULLRAM_BANK11526_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11526_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11527
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11527_DATA_W                                         32
#define RFC_ULLRAM_BANK11527_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11527_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11528
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11528_DATA_W                                         32
#define RFC_ULLRAM_BANK11528_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11528_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11529
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11529_DATA_W                                         32
#define RFC_ULLRAM_BANK11529_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11529_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11530
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11530_DATA_W                                         32
#define RFC_ULLRAM_BANK11530_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11530_DATA_S                                          0

