nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11531
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11531_DATA_W                                         32
#define RFC_ULLRAM_BANK11531_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11531_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11532
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11532_DATA_W                                         32
#define RFC_ULLRAM_BANK11532_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11532_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11533
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11533_DATA_W                                         32
#define RFC_ULLRAM_BANK11533_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11533_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11534
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11534_DATA_W                                         32
#define RFC_ULLRAM_BANK11534_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11534_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11535
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11535_DATA_W                                         32
#define RFC_ULLRAM_BANK11535_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11535_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11536
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11536_DATA_W                                         32
#define RFC_ULLRAM_BANK11536_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11536_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11537
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11537_DATA_W                                         32
#define RFC_ULLRAM_BANK11537_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11537_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11538
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11538_DATA_W                                         32
#define RFC_ULLRAM_BANK11538_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11538_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11539
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11539_DATA_W                                         32
#define RFC_ULLRAM_BANK11539_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11539_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11540
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11540_DATA_W                                         32
#define RFC_ULLRAM_BANK11540_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11540_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11541
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11541_DATA_W                                         32
#define RFC_ULLRAM_BANK11541_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11541_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11542
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11542_DATA_W                                         32
#define RFC_ULLRAM_BANK11542_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11542_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11543
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11543_DATA_W                                         32
#define RFC_ULLRAM_BANK11543_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11543_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11544
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11544_DATA_W                                         32
#define RFC_ULLRAM_BANK11544_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11544_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11545
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11545_DATA_W                                         32
#define RFC_ULLRAM_BANK11545_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11545_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11546
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11546_DATA_W                                         32
#define RFC_ULLRAM_BANK11546_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11546_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11547
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11547_DATA_W                                         32
#define RFC_ULLRAM_BANK11547_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11547_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11548
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11548_DATA_W                                         32
#define RFC_ULLRAM_BANK11548_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11548_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11549
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11549_DATA_W                                         32
#define RFC_ULLRAM_BANK11549_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11549_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11550
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11550_DATA_W                                         32
#define RFC_ULLRAM_BANK11550_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11550_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11551
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11551_DATA_W                                         32
#define RFC_ULLRAM_BANK11551_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11551_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11552
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11552_DATA_W                                         32
#define RFC_ULLRAM_BANK11552_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11552_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11553
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11553_DATA_W                                         32
#define RFC_ULLRAM_BANK11553_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11553_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11554
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11554_DATA_W                                         32
#define RFC_ULLRAM_BANK11554_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11554_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11555
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11555_DATA_W                                         32
#define RFC_ULLRAM_BANK11555_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11555_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11556
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11556_DATA_W                                         32
#define RFC_ULLRAM_BANK11556_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11556_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11557
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11557_DATA_W                                         32
#define RFC_ULLRAM_BANK11557_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11557_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11558
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11558_DATA_W                                         32
#define RFC_ULLRAM_BANK11558_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11558_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11559
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11559_DATA_W                                         32
#define RFC_ULLRAM_BANK11559_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11559_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11560
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11560_DATA_W                                         32
#define RFC_ULLRAM_BANK11560_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11560_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11561
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11561_DATA_W                                         32
#define RFC_ULLRAM_BANK11561_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11561_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11562
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11562_DATA_W                                         32
#define RFC_ULLRAM_BANK11562_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11562_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11563
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11563_DATA_W                                         32
#define RFC_ULLRAM_BANK11563_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11563_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11564
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11564_DATA_W                                         32
#define RFC_ULLRAM_BANK11564_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11564_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11565
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11565_DATA_W                                         32
#define RFC_ULLRAM_BANK11565_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11565_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11566
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11566_DATA_W                                         32
#define RFC_ULLRAM_BANK11566_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11566_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11567
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11567_DATA_W                                         32
#define RFC_ULLRAM_BANK11567_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11567_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11568
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11568_DATA_W                                         32
#define RFC_ULLRAM_BANK11568_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11568_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11569
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11569_DATA_W                                         32
#define RFC_ULLRAM_BANK11569_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11569_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11570
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11570_DATA_W                                         32
#define RFC_ULLRAM_BANK11570_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11570_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11571
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11571_DATA_W                                         32
#define RFC_ULLRAM_BANK11571_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11571_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11572
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11572_DATA_W                                         32
#define RFC_ULLRAM_BANK11572_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11572_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11573
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11573_DATA_W                                         32
#define RFC_ULLRAM_BANK11573_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11573_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11574
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11574_DATA_W                                         32
#define RFC_ULLRAM_BANK11574_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11574_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11575
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11575_DATA_W                                         32
#define RFC_ULLRAM_BANK11575_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11575_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11576
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11576_DATA_W                                         32
#define RFC_ULLRAM_BANK11576_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11576_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11577
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11577_DATA_W                                         32
#define RFC_ULLRAM_BANK11577_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11577_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11578
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11578_DATA_W                                         32
#define RFC_ULLRAM_BANK11578_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11578_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11579
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11579_DATA_W                                         32
#define RFC_ULLRAM_BANK11579_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11579_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11580
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11580_DATA_W                                         32
#define RFC_ULLRAM_BANK11580_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11580_DATA_S                                          0

