nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11581
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11581_DATA_W                                         32
#define RFC_ULLRAM_BANK11581_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11581_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11582
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11582_DATA_W                                         32
#define RFC_ULLRAM_BANK11582_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11582_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11583
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11583_DATA_W                                         32
#define RFC_ULLRAM_BANK11583_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11583_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11584
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11584_DATA_W                                         32
#define RFC_ULLRAM_BANK11584_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11584_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11585
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11585_DATA_W                                         32
#define RFC_ULLRAM_BANK11585_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11585_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11586
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11586_DATA_W                                         32
#define RFC_ULLRAM_BANK11586_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11586_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11587
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11587_DATA_W                                         32
#define RFC_ULLRAM_BANK11587_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11587_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11588
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11588_DATA_W                                         32
#define RFC_ULLRAM_BANK11588_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11588_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11589
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11589_DATA_W                                         32
#define RFC_ULLRAM_BANK11589_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11589_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11590
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11590_DATA_W                                         32
#define RFC_ULLRAM_BANK11590_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11590_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11591
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11591_DATA_W                                         32
#define RFC_ULLRAM_BANK11591_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11591_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11592
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11592_DATA_W                                         32
#define RFC_ULLRAM_BANK11592_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11592_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11593
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11593_DATA_W                                         32
#define RFC_ULLRAM_BANK11593_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11593_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11594
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11594_DATA_W                                         32
#define RFC_ULLRAM_BANK11594_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11594_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11595
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11595_DATA_W                                         32
#define RFC_ULLRAM_BANK11595_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11595_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11596
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11596_DATA_W                                         32
#define RFC_ULLRAM_BANK11596_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11596_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11597
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11597_DATA_W                                         32
#define RFC_ULLRAM_BANK11597_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11597_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11598
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11598_DATA_W                                         32
#define RFC_ULLRAM_BANK11598_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11598_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11599
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11599_DATA_W                                         32
#define RFC_ULLRAM_BANK11599_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11599_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11600
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11600_DATA_W                                         32
#define RFC_ULLRAM_BANK11600_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11600_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11601
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11601_DATA_W                                         32
#define RFC_ULLRAM_BANK11601_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11601_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11602
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11602_DATA_W                                         32
#define RFC_ULLRAM_BANK11602_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11602_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11603
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11603_DATA_W                                         32
#define RFC_ULLRAM_BANK11603_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11603_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11604
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11604_DATA_W                                         32
#define RFC_ULLRAM_BANK11604_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11604_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11605
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11605_DATA_W                                         32
#define RFC_ULLRAM_BANK11605_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11605_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11606
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11606_DATA_W                                         32
#define RFC_ULLRAM_BANK11606_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11606_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11607
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11607_DATA_W                                         32
#define RFC_ULLRAM_BANK11607_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11607_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11608
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11608_DATA_W                                         32
#define RFC_ULLRAM_BANK11608_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11608_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11609
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11609_DATA_W                                         32
#define RFC_ULLRAM_BANK11609_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11609_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11610
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11610_DATA_W                                         32
#define RFC_ULLRAM_BANK11610_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11610_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11611
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11611_DATA_W                                         32
#define RFC_ULLRAM_BANK11611_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11611_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11612
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11612_DATA_W                                         32
#define RFC_ULLRAM_BANK11612_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11612_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11613
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11613_DATA_W                                         32
#define RFC_ULLRAM_BANK11613_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11613_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11614
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11614_DATA_W                                         32
#define RFC_ULLRAM_BANK11614_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11614_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11615
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11615_DATA_W                                         32
#define RFC_ULLRAM_BANK11615_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11615_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11616
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11616_DATA_W                                         32
#define RFC_ULLRAM_BANK11616_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11616_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11617
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11617_DATA_W                                         32
#define RFC_ULLRAM_BANK11617_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11617_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11618
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11618_DATA_W                                         32
#define RFC_ULLRAM_BANK11618_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11618_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11619
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11619_DATA_W                                         32
#define RFC_ULLRAM_BANK11619_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11619_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11620
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11620_DATA_W                                         32
#define RFC_ULLRAM_BANK11620_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11620_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11621
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11621_DATA_W                                         32
#define RFC_ULLRAM_BANK11621_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11621_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11622
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11622_DATA_W                                         32
#define RFC_ULLRAM_BANK11622_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11622_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11623
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11623_DATA_W                                         32
#define RFC_ULLRAM_BANK11623_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11623_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11624
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11624_DATA_W                                         32
#define RFC_ULLRAM_BANK11624_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11624_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11625
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11625_DATA_W                                         32
#define RFC_ULLRAM_BANK11625_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11625_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11626
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11626_DATA_W                                         32
#define RFC_ULLRAM_BANK11626_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11626_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11627
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11627_DATA_W                                         32
#define RFC_ULLRAM_BANK11627_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11627_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11628
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11628_DATA_W                                         32
#define RFC_ULLRAM_BANK11628_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11628_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11629
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11629_DATA_W                                         32
#define RFC_ULLRAM_BANK11629_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11629_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11630
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11630_DATA_W                                         32
#define RFC_ULLRAM_BANK11630_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11630_DATA_S                                          0

