nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11681
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11681_DATA_W                                         32
#define RFC_ULLRAM_BANK11681_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11681_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11682
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11682_DATA_W                                         32
#define RFC_ULLRAM_BANK11682_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11682_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11683
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11683_DATA_W                                         32
#define RFC_ULLRAM_BANK11683_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11683_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11684
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11684_DATA_W                                         32
#define RFC_ULLRAM_BANK11684_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11684_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11685
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11685_DATA_W                                         32
#define RFC_ULLRAM_BANK11685_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11685_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11686
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11686_DATA_W                                         32
#define RFC_ULLRAM_BANK11686_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11686_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11687
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11687_DATA_W                                         32
#define RFC_ULLRAM_BANK11687_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11687_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11688
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11688_DATA_W                                         32
#define RFC_ULLRAM_BANK11688_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11688_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11689
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11689_DATA_W                                         32
#define RFC_ULLRAM_BANK11689_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11689_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11690
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11690_DATA_W                                         32
#define RFC_ULLRAM_BANK11690_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11690_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11691
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11691_DATA_W                                         32
#define RFC_ULLRAM_BANK11691_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11691_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11692
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11692_DATA_W                                         32
#define RFC_ULLRAM_BANK11692_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11692_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11693
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11693_DATA_W                                         32
#define RFC_ULLRAM_BANK11693_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11693_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11694
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11694_DATA_W                                         32
#define RFC_ULLRAM_BANK11694_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11694_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11695
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11695_DATA_W                                         32
#define RFC_ULLRAM_BANK11695_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11695_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11696
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11696_DATA_W                                         32
#define RFC_ULLRAM_BANK11696_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11696_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11697
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11697_DATA_W                                         32
#define RFC_ULLRAM_BANK11697_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11697_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11698
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11698_DATA_W                                         32
#define RFC_ULLRAM_BANK11698_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11698_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11699
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11699_DATA_W                                         32
#define RFC_ULLRAM_BANK11699_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11699_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11700
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11700_DATA_W                                         32
#define RFC_ULLRAM_BANK11700_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11700_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11701
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11701_DATA_W                                         32
#define RFC_ULLRAM_BANK11701_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11701_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11702
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11702_DATA_W                                         32
#define RFC_ULLRAM_BANK11702_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11702_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11703
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11703_DATA_W                                         32
#define RFC_ULLRAM_BANK11703_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11703_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11704
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11704_DATA_W                                         32
#define RFC_ULLRAM_BANK11704_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11704_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11705
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11705_DATA_W                                         32
#define RFC_ULLRAM_BANK11705_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11705_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11706
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11706_DATA_W                                         32
#define RFC_ULLRAM_BANK11706_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11706_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11707
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11707_DATA_W                                         32
#define RFC_ULLRAM_BANK11707_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11707_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11708
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11708_DATA_W                                         32
#define RFC_ULLRAM_BANK11708_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11708_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11709
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11709_DATA_W                                         32
#define RFC_ULLRAM_BANK11709_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11709_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11710
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11710_DATA_W                                         32
#define RFC_ULLRAM_BANK11710_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11710_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11711
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11711_DATA_W                                         32
#define RFC_ULLRAM_BANK11711_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11711_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11712
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11712_DATA_W                                         32
#define RFC_ULLRAM_BANK11712_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11712_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11713
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11713_DATA_W                                         32
#define RFC_ULLRAM_BANK11713_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11713_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11714
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11714_DATA_W                                         32
#define RFC_ULLRAM_BANK11714_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11714_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11715
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11715_DATA_W                                         32
#define RFC_ULLRAM_BANK11715_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11715_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11716
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11716_DATA_W                                         32
#define RFC_ULLRAM_BANK11716_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11716_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11717
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11717_DATA_W                                         32
#define RFC_ULLRAM_BANK11717_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11717_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11718
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11718_DATA_W                                         32
#define RFC_ULLRAM_BANK11718_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11718_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11719
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11719_DATA_W                                         32
#define RFC_ULLRAM_BANK11719_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11719_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11720
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11720_DATA_W                                         32
#define RFC_ULLRAM_BANK11720_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11720_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11721
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11721_DATA_W                                         32
#define RFC_ULLRAM_BANK11721_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11721_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11722
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11722_DATA_W                                         32
#define RFC_ULLRAM_BANK11722_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11722_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11723
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11723_DATA_W                                         32
#define RFC_ULLRAM_BANK11723_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11723_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11724
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11724_DATA_W                                         32
#define RFC_ULLRAM_BANK11724_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11724_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11725
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11725_DATA_W                                         32
#define RFC_ULLRAM_BANK11725_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11725_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11726
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11726_DATA_W                                         32
#define RFC_ULLRAM_BANK11726_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11726_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11727
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11727_DATA_W                                         32
#define RFC_ULLRAM_BANK11727_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11727_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11728
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11728_DATA_W                                         32
#define RFC_ULLRAM_BANK11728_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11728_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11729
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11729_DATA_W                                         32
#define RFC_ULLRAM_BANK11729_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11729_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11730
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11730_DATA_W                                         32
#define RFC_ULLRAM_BANK11730_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11730_DATA_S                                          0

