nanoframework/SimpleLink_CC13xx_26xx_SDK/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11731
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11731_DATA_W                                         32
#define RFC_ULLRAM_BANK11731_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11731_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11732
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11732_DATA_W                                         32
#define RFC_ULLRAM_BANK11732_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11732_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11733
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11733_DATA_W                                         32
#define RFC_ULLRAM_BANK11733_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11733_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11734
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11734_DATA_W                                         32
#define RFC_ULLRAM_BANK11734_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11734_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11735
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11735_DATA_W                                         32
#define RFC_ULLRAM_BANK11735_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11735_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11736
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11736_DATA_W                                         32
#define RFC_ULLRAM_BANK11736_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11736_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11737
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11737_DATA_W                                         32
#define RFC_ULLRAM_BANK11737_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11737_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11738
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11738_DATA_W                                         32
#define RFC_ULLRAM_BANK11738_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11738_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11739
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11739_DATA_W                                         32
#define RFC_ULLRAM_BANK11739_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11739_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11740
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11740_DATA_W                                         32
#define RFC_ULLRAM_BANK11740_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11740_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11741
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11741_DATA_W                                         32
#define RFC_ULLRAM_BANK11741_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11741_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11742
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11742_DATA_W                                         32
#define RFC_ULLRAM_BANK11742_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11742_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11743
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11743_DATA_W                                         32
#define RFC_ULLRAM_BANK11743_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11743_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11744
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11744_DATA_W                                         32
#define RFC_ULLRAM_BANK11744_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11744_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11745
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11745_DATA_W                                         32
#define RFC_ULLRAM_BANK11745_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11745_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11746
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11746_DATA_W                                         32
#define RFC_ULLRAM_BANK11746_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11746_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11747
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11747_DATA_W                                         32
#define RFC_ULLRAM_BANK11747_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11747_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11748
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11748_DATA_W                                         32
#define RFC_ULLRAM_BANK11748_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11748_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11749
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11749_DATA_W                                         32
#define RFC_ULLRAM_BANK11749_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11749_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11750
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11750_DATA_W                                         32
#define RFC_ULLRAM_BANK11750_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11750_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11751
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11751_DATA_W                                         32
#define RFC_ULLRAM_BANK11751_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11751_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11752
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11752_DATA_W                                         32
#define RFC_ULLRAM_BANK11752_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11752_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11753
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11753_DATA_W                                         32
#define RFC_ULLRAM_BANK11753_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11753_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11754
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11754_DATA_W                                         32
#define RFC_ULLRAM_BANK11754_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11754_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11755
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11755_DATA_W                                         32
#define RFC_ULLRAM_BANK11755_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11755_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11756
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11756_DATA_W                                         32
#define RFC_ULLRAM_BANK11756_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11756_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11757
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11757_DATA_W                                         32
#define RFC_ULLRAM_BANK11757_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11757_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11758
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11758_DATA_W                                         32
#define RFC_ULLRAM_BANK11758_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11758_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11759
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11759_DATA_W                                         32
#define RFC_ULLRAM_BANK11759_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11759_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11760
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11760_DATA_W                                         32
#define RFC_ULLRAM_BANK11760_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11760_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11761
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11761_DATA_W                                         32
#define RFC_ULLRAM_BANK11761_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11761_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11762
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11762_DATA_W                                         32
#define RFC_ULLRAM_BANK11762_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11762_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11763
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11763_DATA_W                                         32
#define RFC_ULLRAM_BANK11763_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11763_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11764
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11764_DATA_W                                         32
#define RFC_ULLRAM_BANK11764_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11764_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11765
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11765_DATA_W                                         32
#define RFC_ULLRAM_BANK11765_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11765_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11766
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11766_DATA_W                                         32
#define RFC_ULLRAM_BANK11766_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11766_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11767
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11767_DATA_W                                         32
#define RFC_ULLRAM_BANK11767_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11767_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11768
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11768_DATA_W                                         32
#define RFC_ULLRAM_BANK11768_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11768_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11769
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11769_DATA_W                                         32
#define RFC_ULLRAM_BANK11769_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11769_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11770
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11770_DATA_W                                         32
#define RFC_ULLRAM_BANK11770_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11770_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11771
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11771_DATA_W                                         32
#define RFC_ULLRAM_BANK11771_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11771_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11772
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11772_DATA_W                                         32
#define RFC_ULLRAM_BANK11772_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11772_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11773
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11773_DATA_W                                         32
#define RFC_ULLRAM_BANK11773_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11773_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11774
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11774_DATA_W                                         32
#define RFC_ULLRAM_BANK11774_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11774_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11775
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11775_DATA_W                                         32
#define RFC_ULLRAM_BANK11775_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11775_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11776
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11776_DATA_W                                         32
#define RFC_ULLRAM_BANK11776_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11776_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11777
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11777_DATA_W                                         32
#define RFC_ULLRAM_BANK11777_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11777_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11778
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11778_DATA_W                                         32
#define RFC_ULLRAM_BANK11778_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11778_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11779
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11779_DATA_W                                         32
#define RFC_ULLRAM_BANK11779_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11779_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11780
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11780_DATA_W                                         32
#define RFC_ULLRAM_BANK11780_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11780_DATA_S                                          0

